<#
    ⏹参考资料:
    1. https://hazime-style.com/?p=896
    2. https://qiita.com/arachan@github/items/0397065b405d601fcfa1
#>

# ⏹csv字符串数据(没有标题)
$csvStrData = @"
"苹果","100","01","20"
"苹果","80","02","30"
"香蕉","70","01","33"
"香蕉","85","02","45"
"西瓜","52","01","330"
"西瓜","41","02","450"
"@

# ⏹csv字符串转换为csv对象的同时给添加标题
$csvObj = $csvStrData | ConvertFrom-Csv -Header @("水果", "价格", "月份", "销量")
# 直接通过 Out-Host 将内容输出到控制台上
$csvObj | Out-Host
<#
    水果 价格 月份 销量
    ---- ---- ---- ----
    苹果 100  01   20
    苹果 80   02   30
    香蕉 70   01   33
    香蕉 85   02   45
    西瓜 52   01   330
    西瓜 41   02   450
#>
Write-Host '↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳' -ForegroundColor Red

<#
    ⏹分组
        根据 水果 字段进行分组
#>
$group_result = $csvObj | Group-Object "水果"
$group_result | Out-Host
<#
    Count Name     Group
    ----- ----     -----
        2 苹果     {@{水果=苹果; 价格=100; 月份=01; 销量=20}, @{水果=苹果; 价格=80; 月份=02; 销量=30}}
        2 香蕉     {@{水果=香蕉; 价格=70; 月份=01; 销量=33}, @{水果=香蕉; 价格=85; 月份=02; 销量=45}}
        2 西瓜     {@{水果=西瓜; 价格=52; 月份=01; 销量=330}, @{水果=西瓜; 价格=41; 月份=02; 销量=450}}
#>
Write-Host '↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳' -ForegroundColor Red

<#
    ⏹将分组之后的结果转换为json然后输出到控制台上
        $group_result[0, 1] | Select-Object -Property "Name", "Group"
            从数组中获取下标为0和1的元素后,再选取其中的 Name, Group 属性
        ConvertTo-Json -Depth 3
            -Depth: 从0到100的任意数字,默认值为2
#>

$group_result[0, 1] | Select-Object -Property "Name", "Group" `
| ConvertTo-Json -Depth 3 | Out-Host
<#
    [
        {
            "Name":  "苹果",
            "Group":  [
                        {
                            "水果":  "苹果",
                            "价格":  "100",
                            "月份":  "01",
                            "销量":  "20"
                        },
                        {
                            "水果":  "苹果",
                            "价格":  "80",
                            "月份":  "02",
                            "销量":  "30"
                        }
                    ]
        },
        {
            "Name":  "香蕉",
            "Group":  [
                        {
                            "水果":  "香蕉",
                            "价格":  "70",
                            "月份":  "01",
                            "销量":  "33"
                        },
                        {
                            "水果":  "香蕉",
                            "价格":  "85",
                            "月份":  "02",
                            "销量":  "45"
                        }
                    ]
        }
    ]
#>
Write-Host '↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳↳' -ForegroundColor Red

# ⏹获取苹果1月份的销量
$res = $group_result[0].Group[0]."销量"
("苹果1月份的销量为: $($res)") | Out-Host