<#
    CLSID 是一串由系统分配的全局唯一标识符，格式为 ::{XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX}。
    在文件资源管理器地址栏或“运行”对话框（Win + R）中输入这些代码，就能直接跳转到对应的系统位置。
#>

# 打开凭据管理器
Start-Process "shell:::{1206F5F1-0569-412C-8FEC-3204630DFB70}"
powershell.exe -NoProfile -Command "Start-Process 'shell:::{1206F5F1-0569-412C-8FEC-3204630DFB70}'"

# 打开回收站
explorer.exe "shell:::{645ff040-5081-101b-9f08-00aa002f954e}"

##########################
# 系统级核心位置
##########################

# 我的电脑
::{20d04fe0-3aea-1069-a2d8-08002b30309d}
# 回收站
::{645ff040-5081-101b-9f08-00aa002f954e}
# 控制面板
::{21ec2020-3aea-1069-a2dd-08002b30309d}
# 网上邻居
::{208d2c60-3aea-1069-a2d7-08002b30309d}
# 打印机和传真
::{2227a280-3aea-1069-a2de-08002b30309d}
# 管理工具
::{d20ea4e1-3957-11d2-a40b-0c5020524153}
# 所有控制面板项
::{21EC2020-3AEA-1069-A2DD-08002B30309D}
# 所有任务（God Mode）
::{ED7BA470-8E54-465E-825C-99712043E01C}
# 计划任务
::{d6277990-4c6a-11cf-8d87-00aa0060f5bf}
# 字体
::{d20ea4e1-3957-11d2-a40b-0c5020524152}
# 网络连接
::{7007acc7-3202-11d1-aad2-00805fc1270e}
# 历史记录
::{ff393560-c2a7-11cf-bff4-444553540000}
# 临时Internet文件
::{7bd29e00-76c1-11cf-9dd0-00a0c9034933}

##########################
# 用户文件夹与虚拟文件夹
##########################
# 我的文档
::{450d8fba-ad25-11d0-98a8-0800361b1103}
# 下载
::{374DE290-123F-4565-9164-39C4925E467B}
# 开始菜单文件夹
::{48e7caab-b918-4e58-a94d-505519c795dc}
# 程序文件夹
::{7be9d83c-a729-4d97-b5a7-1b7313c39e0a}
# 网络计算机
::{1f4de370-d627-11d1-ba4f-00a0c91eedba}
# 扫描仪和相机
::{e211b736-43fd-11d1-9efb-0000f8757fcd}
# 添加网络位置
::{D4480A50-BA28-11d1-8E75-00C04FA31A86}
# 蓝牙设备
::{28803F59-3A75-4058-995F-4EE5503B023C}
# BitLocker驱动器加密
::{D9EF8727-CAC2-4e60-809E-86F80A666C91}
# 备份和还原
::{B98A2BEA-7D42-4558-8BD1-832F41BAC6FD}
# 凭据管理器
::{1206F5F1-0569-412C-8FEC-3204630DFB70}
::{1206F5F1-0569-412C-8FEC-3204630DFB70}